{
    "head": {
        "title": "Web Dev | Hanane Chyabri"
    },
    "menu": [
        "Home",
        "About",
        "Skills",
        "Projects",
        "Contact"
    ],
    "home": {
        "title": "Hello Word : My name is Hanane Chyabri",
        "subtitle": "Junior Web Developer",
        "short_description": "Passionate about digital creation and problem-solving, I am an enthusiastic and creative junior web developer, I am Looking for a 8 weeks Web Developer internship from 17 April 2024 to 9 June 2024.",
        "marquee": "Looking for a 8 weeks Web Developer internship from 17 April 2024 to 9 June 2024."
    },
    "home_description": [
        "My academic journey has always been closely linked to computer science. In 2012, I obtained my first degree in computer technology, followed by in-depth training in networks and telecommunications. However, eager for specialization and driven by my true passion, I decided to fully dedicate myself to my education in web application development at Interface 3, Brussels. This experience allowed me to intensely explore the field that truly inspires me: web application creation and development, where I find genuine fulfillment. Through every line of code, I strive to bring ideas to life and build innovative solutions. My specialization primarily focuses on backend development, while also strengthening my skills in frontend, particularly in JavaScript, one of my preferred languages. Furthermore, my ability to quickly learn programming languages and my innate aptitude to swiftly grasp the logic behind each language reinforce my belief in my capacity to evolve and adapt swiftly in this ever-evolving field.",
        "My initial lines of code were written in the C language, thus laying the foundations of my passion for programming. Currently, my enthusiasm is directed towards C#, where I aim to deepen my knowledge and apply it in practical ways. I am seeking opportunities that will allow me to broaden my skills and fully harness the potential of the C# language in tangible projects."
    ],
    "about": {
        "about__title": "About Me",
        "about__description": "My educational background and ongoing journey in the field have fostered robust technical skills in web development, accompanied by a strong set of soft skills ",
        "about__image_title": "To discover my soft skills, click on the dots within the image.",
        "qualification_title": "Studies/training",
        "timeline__text1": "Web Applicatio devlopper"
       
    },
    "formation_lieu": [
        "Interface 3 Bruxelles",
        "ENSA Oujda Maroc",
        "EST Oujda Maroc",
        "Lalla Asmae Maroc"
    ],
    "formation_title": [
        "Web Application Developer Training",
        "Networking and telecommunications training",
        "Computer Technician training",
        "Mathematical Sciences"
    ],
    "formation_date": [
        "2023-2024",
        "2012 - 2015",
        "2010 - 2012",
        "2010 "
    ],
    "experience_lieu": [
        "Capgemini Espagne",
        "Ayaline Oujda"
    ],
    "experience_title": [
        "Junior Consultant",
        "Graduation Internship"
    ],
    "soft_skills": [
        "I am attentive to details and I demonstrate responsibility",
        "I love my children, my parents, and programming",
        "I am organized and I respect given deadlines",
        "Quick learning ability for programming languages",
        "When faced with challenges, I take a proactive approach and find effective solutions"
    ],
    "skills": {
        "title_section": "Skills"
    },
    "portfolio": {
        "title_section": "My Works"
    },
    "porjects_titles": [
        "Portfolio",
        "Code canvas.",
        "Ma Plante",
        "TO-DO LIST",
        "WeatherApp - Projet React météo",
        "Exercices: C# | ASP | Python |PHP"
    ],
    "porjects_description": [
        "The website your are navigating right now allows me to display my different projets, professional background and web developer skills. This website is entirely programmed with the web trio HTML/CSS/JavaScript and the integration of MixItUp v3.3.1 library.",
        "The project created in a 3-day hackathon by a team of 4 aimed to develop an interactive page showcasing the importance and role of HTML, CSS, and JavaScript in a web page. Initially, it displayed a basic web page in pure HTML. As the user clicked through, they could choose between 2 different styles to apply to the page. Additionally, they had the ability to add CSS animations and save their preferred version of the page (demonstrating the role of PHP and databases in a web project.) The project provided an opportunity to work as a team and practice using Git.",
        "Ma Plante",
        "TO-DO LIST",
        "WeatherApp - Projet React météo",
        "An ensemble of diversified exercises in C#, ASP.NET, Python, PHP, HTML/CSS covering foundational control structures to advanced concepts such as exception handling, collections, and object-oriented programming "
    ],
    "contact": {
       "message": "Je suis convaincue que mon profil dynamique et mon enthousiasme pour le développement font de moi une candidate intéressante capable de contribuer de manière significative au sein de votre équipe. "
    }

}