{
    "head": {
        "title": "Web Dev | Hanane Chyabri"
    },
    "menu": [
        "Home",
        "About",
        "Skills",
        "Projects",
        "Contact"
    ],
    "home": {
        "title": "Hello World : My name is Hanane Chyabri",
        "subtitle": "Junior Web Developer"
    },
    "home_description": [
        "I remember my first lines of code written on the console in C in 2010...",
        "Passionate about digital creation and problem-solving, and equipped with significant experience in test automation, I decided to further specialize my skills and strengthen my development knowledge through a back-end web developer training at Interface3 in Brussels. This intensive 15-month program allowed me to acquire the necessary skills using various languages and frameworks specific to a web developer.",
        "Currently, I am looking for an 8-week web development internship from April 15, 2024, to June 6, 2024"
    
    ],
    "about": {
        "about__title": "About Me",
        "about__description": "My educational background and ongoing journey in the field have fostered robust technical skills in web development, accompanied by a strong set of soft skills ",
        "about__image_title": "To discover my soft skills, click on the dots within the image.",
        "qualification_title": "Studies/training",
        "timeline__text1": "Web Applicatio devlopper"
       
    },
    "formation_lieu": [
        "Interface 3 Bruxelles",
        "ENSA Oujda Maroc",
        "EST Oujda Maroc",
        "Lalla Asmae Maroc"
    ],
    "formation_title": [
        "Web Application Developer Training",
        "Networking and telecommunications training",
        "Computer Technician training",
        "Mathematical Sciences"
    ],
    "formation_date": [
        "2023-2024",
        "2012 - 2015",
        "2010 - 2012",
        "2010 "
    ],
    "experience_lieu": [
        "Capgemini Espagne",
        "Ayaline Oujda"
    ],
    "experience_title": [
        "Junior Consultant",
        "Graduation Internship"
    ],
    "soft_skills": [
        "I am attentive to details and I demonstrate responsibility",
        "I love my children, my parents, and programming",
        "I am organized and I respect given deadlines",
        "Quick learning ability for programming languages",
        "When faced with challenges, I take a proactive approach and find effective solutions"
    ],
    "skills": {
        "title_section": "Skills"
    },
    "portfolio": {
        "title_section": "My Works"
    },
    "porjects_titles": [
        "Portfolio",
        "Code canvas.",
        "Ma Plante",
        "TO-DO LIST",
        "WeatherApp - Projet React météo",
        "Exercices: C# | ASP | Python |PHP"
    ],
    "porjects_description": [
        "The website your are navigating right now allows me to display my different projets, professional background and web developer skills. This website is entirely programmed with the web trio HTML/CSS/JavaScript and the integration of MixItUp v3.3.1 library.",
        "The project created in a 3-day hackathon by a team of 4 aimed to develop an interactive page showcasing the importance and role of HTML, CSS, and JavaScript in a web page. Initially, it displayed a basic web page in pure HTML. As the user clicked through, they could choose between 2 different styles to apply to the page. Additionally, they had the ability to add CSS animations and save their preferred version of the page (demonstrating the role of PHP and databases in a web project.) The project provided an opportunity to work as a team and practice using Git.",
        "Ma Plante",
        "TO-DO LIST",
        "WeatherApp - Projet React météo",
        "An ensemble of diversified exercises in C#, ASP.NET, Python, PHP, HTML/CSS covering foundational control structures to advanced concepts such as exception handling, collections, and object-oriented programming "
    ],
    "contact": [
        "Explore my LinkedIn profile to discover in detail my professional experiences and academic background.",
        "For a printed version of my resume, I invite you to download the available PDF file",
        "Feel free to explore my projects on GitHub: Through every line of code, I aim to bring ideas to life."
    ]

}