{
    "head": {
        "title": "Web Dev | Hanane Chyabri"
    },
    "menu": [
        "Acceuil",
        "A propos",
        "Compétences",
        "Projets",
        "Contact"
    ],
    "home": {
        "title": "Bonjour je m'apelle Hanane",
        "subtitle": "Web Developpeuse junior"
    },
    "home_description": [
        "Je me souviens de mes premières lignes de code écrites sur la console en C en 2010...",
        "Passionnée par la création digitale et la résolution de problèmes, et dotée d'une expérience significative en automatisation des tests, j'ai décidé de donner une spécialisation supplémentaire à mon parcours et de consolider mon apprentissage du développement dans le cadre d'une formation de développeuse web back-end auprès d'Interface3 à Bruxelles. Cette formation intensive de 15 mois m'a permis d'acquérir les compétences nécessaires en utilisant différents langages et frameworks propres à une développeuse web.",
        "Actuellement je suis à la recherche d'un stage de développement web de 8 semaines, du 17 avril 2024 au 9 juin 2024"

    ],
    "about": {
        "about__title": "A propos de Moi",
        "about__description": "Mes différentes formations, études et expériences m'ont permis de développer et de renforcer des qualités personnelles, essentielles dans mon parcours de développeuse junior.",
        "about__image_title": "Pour découvrir mes soft skills, cliquez sur les points sur l'image.",
        "qualification_title": "Études/Formations",
        "timeline__text1": "Formation web application devlopper"
       
    },
    "formation_lieu": [
        "Interface 3 Bruxelles",
        "ENSA Oujda Maroc",
        "EST Oujda Maroc",
        "Lalla Asmae Maroc"
    ],
    "formation_title": [
        "Formation de Web Application Developer",
        "Réseau et télécommunication",
        "Technicien informatique",
        "baccalauréat scientifique mathématiques"
    ],
    "formation_date": [
        "2023-2024",
        "2012 - 2015",
        "2010 - 2012",
        "2010 "
    ],
    "experience_lieu": [
        "Capgemini Espagne",
        "Ayaline Oujda"
    ],
    "experience_title": [
        "Consultante Junior",
        "Satge de Fin d'études"
    ],
    "soft_skills": [
        "Je suis attentif aux détails et je fais preuve de responsabilité.",
        "J'aime mes enfants, mes parents et la programmation.",
        "Je suis organisée et je respecte les délais impartis.",
        "Capacité d'apprentissage rapide pour les langages de programmation",
        "Face à des défis, j'adopte une approche proactive et trouve des solutions efficaces."
    ],
    "skills": {
        "title_section": "Compétences"
    },
    "portfolio": {
        "title_section": "Mes Projets"
    },
    "porjects_titles": [
        "Portfolio",
        "Code canvas.",
        "Ma Plante",
        "TO-DO LIST",
        "WeatherApp - Projet React météo",
        "Exercices: C# | ASP | Python |PHP"
    ],
    "porjects_description": [
        "f The website your are navigating right now allows me to display my different projets, professional background and web developer skills. This website is entirely programmed with the web trio HTML/CSS/JavaScript and the integration of MixItUp v3.3.1 library.",
        "f The project created in a 3-day hackathon by a team of 4 aimed to develop an interactive page showcasing the importance and role of HTML, CSS, and JavaScript in a web page. Initially, it displayed a basic web page in pure HTML. As the user clicked through, they could choose between 2 different styles to apply to the page. Additionally, they had the ability to add CSS animations and save their preferred version of the page (demonstrating the role of PHP and databases in a web project.) The project provided an opportunity to work as a team and practice using Git.",
        "f Ma Plante",
        "f TO-DO LIST",
        "f WeatherApp - Projet React météo",
        "f An ensemble of diversified exercises in C#, ASP.NET, Python, PHP, HTML/CSS covering foundational control structures to advanced concepts such as exception handling, collections, and object-oriented programming "
    ],
    "contact": {
       "message": "Je suis convaincue que mon profil dynamique et mon enthousiasme pour le développement font de moi une candidate intéressante capable de contribuer de manière significative au sein de votre équipe. "
    }

}