{
    "head": {
        "title": "Web Dev | Hanane Chyabri"
    },
    "menu": [
        "Acceuil",
        "A propos",
        "Compétences",
        "Projets",
        "Contact"
    ],
    "home": {
        "title": "Bonjour je m'apelle Hanane",
        "subtitle": "Web Dévloppeuse junior"
    },
    "home_description": [
        "Je me souviens de mes premières lignes de code écrites sur la console en C en 2010...",
        "Passionnée par la création digitale et la résolution de problèmes, et dotée d'une expérience significative en automatisation des tests, j'ai décidé de donner une spécialisation supplémentaire à mon parcours et de consolider mon apprentissage du développement dans le cadre d'une formation de développeuse web back-end auprès d'Interface3 à Bruxelles. Cette formation intensive de 15 mois m'a permis d'acquérir les compétences nécessaires en utilisant différents langages et frameworks propres à une développeuse web.",
        "Actuellement je suis à la recherche d'un stage de développement web de 8 semaines, du 15 avril 2024 au 6 juin 2024"

    ],
    "about": {
        "about__title": "A propos de Moi",
        "about__description": "Mes différentes formations, études et expériences m'ont permis de développer et de renforcer des qualités personnelles, essentielles dans mon parcours de développeuse junior.",
        "about__image_title": "Pour découvrir mes soft skills, cliquez sur les points sur l'image.",
        "qualification_title": "Études/Formations",
        "timeline__text1": "Formation web application devlopper"
       
    },
    "formation_lieu": [
        "Interface 3 Bruxelles",
        "ENSA Oujda Maroc",
        "EST Oujda Maroc",
        "Lalla Asmae Maroc"
    ],
    "formation_title": [
        "Formation de Web Application Developer",
        "Réseau et télécommunication",
        "Technicien informatique",
        "baccalauréat scientifique mathématiques"
    ],
    "formation_date": [
        "2023-2024",
        "2012 - 2015",
        "2010 - 2012",
        "2010 "
    ],
    "experience_lieu": [
        "Capgemini Espagne",
        "Ayaline Oujda"
    ],
    "experience_title": [
        "Consultante Junior",
        "Satge de Fin d'études"
    ],
    "soft_skills": [
        "Je suis attentif aux détails et je fais preuve de responsabilité.",
        "J'aime mes enfants, mes parents et la programmation.",
        "Je suis organisée et je respecte les délais impartis.",
        "Capacité d'apprentissage rapide pour les langages de programmation",
        "Face à des défis, j'adopte une approche proactive et trouve des solutions efficaces."
    ],
    "skills": {
        "title_section": "Compétences"
    },
    "portfolio": {
        "title_section": "Mes Projets"
    },
    "porjects_titles": [
        "Portfolio",
        "Code canvas.",
        "Ma Plante",
        "TO-DO LIST",
        "WeatherApp - Projet React météo",
        "Exercices: C# | ASP | Python |PHP"
    ],
    "porjects_description": [
        "Le site sur lequel vous naviguez actuellement est un projet scolaire qui m'a permis de présenter mes différents projets, mon parcours professionnel et mes compétences de développeuse web. Ce site est entièrement codé avec le trio web HTML/CSS/JavaScript. Incluant des modes bilingues et la possiblité de choisir entre 3 style de colour, avec integration de la bibliothéque MixItUp v3.3.1 pour le filtre.",
        "The project created in a 3-day hackathon by a team of 4 aimed to develop an interactive page showcasing the importance and role of HTML, CSS, and JavaScript in a web page. Initially, it displayed a basic web page in pure HTML. As the user clicked through, they could choose between 2 different styles to apply to the page. Additionally, they had the ability to add CSS animations and save their preferred version of the page (demonstrating the role of PHP and databases in a web project.) The project provided an opportunity to work as a team and practice using Git.",
        "Une application symfony qui permet aux utilisateurs de trouver facilement la plante idéale à cultiver chez eux en répondant à quelques critères. En plus, elle offre la possibilité de se connecter/déconnecter, d'ajouter des plantes à leur liste de favoris et de les ajouter au panier.",
        "TO-DO LIST :  En jQuery, permettant d'ajouter/supprimer/marquer comme terminée des tâches, avec possibilité d'enregistrer les taches même après avoir fermé et rouvert la page grâce au localStorage.",
        "Ce projet représente une application météo simple construite avec React, tirant parti de l'API OpenWeatherMap pour fournir des données météorologiques en temps réel pour une ville spécifique",
        "An ensemble of diversified exercises in C#, ASP.NET, Python, PHP, HTML/CSS covering foundational control structures to advanced concepts such as exception handling, collections, and object-oriented programming ",
        "Le Démineur est un jeu de logique où le joueur découvre des cases sur un plateau, évitant les mines dissimulées, tout en utilisant des indices pour déterminer leur emplacement. L'objectif est de révéler toutes les cases sûres sans déclencher une seule mine",
        "Gestion des etudiants",
        "Gestion de Cinema",
        "Une interface web pour visualiser, trier et ordonner les produits, et les commentaires publiés par les internautes",
        "Angular comming soon",
        "Node js comming soon"
    ],
    "contact": [
        "Explorez mon profil LinkedIn pour découvrir en détail mes expériences professionnelles et mon parcours académique",
        "Pour une version imprimée de mon CV, je vous invite à télécharger le fichier PDF disponible.",
        "N'hésitez pas à explorer mes projets sur GIT : À travers chaque ligne de code, je cherche à donner vie à des idées"
    ]

}